// Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, в которой все заглавные буквы заменены на строчные.
string str = "dsadASDASdsds";
string res = str.ToLower();
Console.WriteLine(res);